Revit 2026 API

# IntegerParameterValue Class

---

A class that holds an Integer value of a parameter element.

SystemObject Autodesk.Revit.DBParameterValue Autodesk.Revit.DBIntegerParameterValue

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class IntegerParameterValue : ParameterValue
```
```vb
Public Class IntegerParameterValue
	Inherits ParameterValue
```
```cpp
public ref class IntegerParameterValue : public ParameterValue
```
```fsharp
type IntegerParameterValue =
    class
        inherit ParameterValue
    end
```

The IntegerParameterValue type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IntegerParameterValue | Default constructor |
|  | IntegerParameterValue(Int32) | Value constructor |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from ParameterValue) |
|  | Value | The stored value |

|  | Name | Description |
| --- | --- | --- |
|  | Copy | Makes an identical copy of the given parameter value. (Inherited from ParameterValue) |
|  | Dispose | (Inherited from ParameterValue) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsEqual | Tests equality with another instance of the same class. (Inherited from ParameterValue) |
|  | IsSameType | Tests another instance is of the same value type. (Inherited from ParameterValue) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace